### In-Game Purchase Data Analysis

#### Background 

In this homework, you are ask to deal with a task of analyzing an "in-game purchase" dataset. In this game, players are able to to purchase optional items that enhance their playing experience. Now your task is to generate a report that breaks down the game's purchasing data into meaningful insights.

-----

#### Observable Trends

* There are 1163 active players. The vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.79%) with secondary groups falling between 15-19 (18.58%) and 25-29 (13.37%). 

* The age group that spends the most money is the 20-24 with 1,114.06 dollars as total purchase value and an average purchase of 4.32. In contrast, the demographic group that has the highest average purchase is the 35-39 with 4.76 and a total purchase value of 147.67. 
-----

In [2]:
import pandas as pd
import numpy as np

# Raw data file
file_to_load = "purchase_data.csv"

# Read purchasing file and store into pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [7]:
total_players = purchase_data['SN'].nunique()
# print(f"Total Number of Players: {total_players}")
df_total_players = pd.DataFrame({'Total Players': [total_players]})
df_total_players

   Total Players
0            576

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.
* Create a summary data frame to hold the results
* Display the summary data frame

In [46]:
# total number of unique items
unique_items = purchase_data['Item ID'].nunique()

# average purchase price
average_price = purchase_data['Price'].mean()

# total number of purchases
total_purchases = purchase_data['Purchase ID'].count()

# total revenue
total_revenue = purchase_data['Price'].sum()

purchasing_summary = pd.DataFrame({
    'Number of Unique Items': [unique_items],
    'Average Price': [average_price],
    'Number of Purchases': [total_purchases],
    'Total Revenue': [total_revenue]
})
purchasing_summary['Average Price'] = purchasing_summary['Average Price'].round(2)
# print(purchasing_summary)
purchasing_summary

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [40]:
# count of players by gender
gender_counts = purchase_data.groupby('Gender')['SN'].nunique().sort_values(ascending=False)

# percentage of players by gender
gender_percentage = (gender_counts / total_players) * 100

# combine counts and percentages into a dataframe
gender_demographics = pd.DataFrame({
    'Percentage of Players': gender_percentage.round(2),
    'Total Count': gender_counts
})

# print(gender_demographics)
gender_demographics

                       Percentage of Players  Total Count
Gender
Male                                   84.03          484
Female                                 14.06           81
Other / Non-Disclosed                   1.91           11


## Purchasing Analysis (Gender)

* Run basic calculations to obtain below values by gender
  * Purchase Count
  * Average Purchase Price  
  * Total Purchase Value
  * Average Purchase Total per Person by Gender
* Create a summary data frame to hold the results
* Display the summary data frame

In [48]:
# group data by gender
gender_purchase = purchase_data.groupby('Gender')

# purchase count by gender
purchase_count = gender_purchase['Purchase ID'].count()

# average purchase price by gender
avg_purchase_price = gender_purchase['Price'].mean()

# total purchase value by gender
total_purchase = gender_purchase['Price'].sum()

# average purchase total per person by gender
avg_purchase_per_person = total_purchase / gender_counts

gender_purchasing_summary = pd.DataFrame({
    'Purchase Count': purchase_count,
    'Average Purchase Price': avg_purchase_price,
    'Total Purchase Value': total_purchase,
    'Average Purchase per Person': avg_purchase_per_person.round(2)
})

# print(gender_purchasing_summary)
gender_purchasing_summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.47
Male,652,3.017853,1967.64,4.07
Other / Non-Disclosed,15,3.346000,50.19,4.56

## Age Demographics

* Categorize players using the age groups. Hint: use pd.cut()
  * each group is for 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
* Calculate the numbers and percentages by age group
* Create a summary data frame to hold the results
* round the percentage column to two decimal points
* Display Age Demographics Table

In [58]:
# define age bins and labels
age_bins = [0, 10, 15, 20, 25, 30, 35, 40, np.inf]  # Added <10 and 40+
age_labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']  # Corresponding labels

# categorize players into age groups
purchase_data['Age Group'] = pd.cut(
    purchase_data['Age'],
    bins=age_bins,
    labels=age_labels,
    right=False
)

total_players = purchase_data['SN'].nunique()

age_counts = purchase_data.groupby('Age Group')['SN'].nunique()

age_percentage = (age_counts / total_players) * 100

age_demographics = pd.DataFrame({
    'Percentage of Players': age_percentage.round(2),
    'Total Count': age_counts
}).reset_index()

# ensure the Age Groups are in the desired order
age_demographics['Age Group'] = pd.Categorical(
    age_demographics['Age Group'],
    categories=age_labels,
    ordered=True
)
age_demographics = age_demographics.sort_values('Age Group')

age_demographics

  Age Group  Percentage of Players  Total Count
0       <10                   2.95           17
1     10-14                   3.82           22
2     15-19                  18.58          107
3     20-24                  44.79          258
4     25-29                  13.37           77
5     30-34                   9.03           52
6     35-39                   5.38           31
7       40+                   2.08           12

## Purchasing Analysis (Age)

* The below each broken into groups of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
  * Purchase Count
  * Average Purchase Price
  * Total Purchase Value
  * Average Purchase Total per Person by Age Group
* Bin the purchase_data data frame by age
* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
* Create a summary data frame to hold the results
* Display the summary data frame

In [60]:
# bin the purchase data by age group
age_grouped = purchase_data.groupby('Age Group')

purchase_count_age = age_grouped['Purchase ID'].count()
avg_purchase_price_age = age_grouped['Price'].mean()
total_purchase_value_age = age_grouped['Price'].sum()
avg_purchase_per_person_age = total_purchase_value_age / age_counts

purchasing_analysis_age = pd.DataFrame({
    'Purchase Count': purchase_count_age,
    'Average Purchase Price': avg_purchase_price_age.round(2),
    'Total Purchase Value': total_purchase_value_age.round(2),
    'Average Purchase per Person': avg_purchase_per_person_age.round(2)
}).reset_index()

# print(purchasing_analysis_age)
purchasing_analysis_age

,Age Group,Purchase Count,Average Purchase Price ($),Total Purchase Value ($),Average Purchase per Person ($)
0,<10,23,3.35,77.13,4.54
1,10-14,28,2.96,82.78,3.76
2,15-19,136,3.04,412.89,3.86
3,20-24,365,3.05,1114.06,4.32
4,25-29,101,2.90,293.00,3.81
5,30-34,73,2.93,214.00,4.12
6,35-39,41,3.60,147.67,4.76
7,40+,13,2.94,38.24,3.19

## Top Spenders

* Identify the the top 5 spenders in the game by total purchase value (top-5 players with highest total purchase value), then list (in a table):
  * SN(screen name)
  * Purchase Count
  * Average Purchase Price
  * Total Purchase Value
* Run basic calculations to obtain the results in the table below
* Create a summary data frame to hold the results
* Sort the total purchase value column in descending order
* Display a preview of the summary data frame

In [65]:
# calculate total purchase value per player
player_purchases = purchase_data.groupby('SN').agg({
    'Purchase ID': 'count',
    'Price': ['mean', 'sum']
})

player_purchases.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']
player_purchases = player_purchases.reset_index()
player_purchases['Average Purchase Price'] = player_purchases['Average Purchase Price'].round(2)
top_spenders = player_purchases.sort_values('Total Purchase Value', ascending=False).head(5)

# print(top_spenders)
top_spenders

              SN  Purchase Count  Average Purchase Price  Total Purchase Value
360    Lisosia93               5                    3.79                 18.96
246  Idastidru52               4                    3.86                 15.45
106   Chamjask73               3                    4.61                 13.83
275       Iral74               4                    3.40                 13.62
281  Iskadarya95               3                    4.37                 13.10

## Most Popular Items

* Top 5 most popular items by purchase count:
  * Item ID
  * Item Name
  * Purchase Count
  * Item Price
  * Total Purchase Value
* Retrieve the Item ID, Item Name, and Item Price columns
* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value
* Create a summary data frame to hold the results
* Sort the purchase count column in descending order
* Display a preview of the summary data frame

In [70]:
# group by item id and item name
item_grouped = purchase_data.groupby(['Item ID', 'Item Name'])

# calculate purchase count, item price, and total purchase value
item_stats = item_grouped.agg({
    'Purchase ID': 'count',
    'Price': 'first',
    'Price': 'sum'
}).rename(columns={
    'Purchase ID': 'Purchase Count',
    'Price': 'Total Purchase Value'
})

# reset index to flatten the dataframe
item_stats = item_stats.reset_index()

# since 'Price' is used twice, we need to adjust
item_stats['Item Price'] = purchase_data.groupby(['Item ID', 'Item Name'])['Price'].first().values
# reorder columns
item_stats = item_stats[['Item ID', 'Item Name', 'Purchase Count', 'Item Price', 'Total Purchase Value']]
# sort by Purchase Count descending and select top 5
most_popular_items = item_stats.sort_values('Purchase Count', ascending=False).head(5)

# print(most_popular_items)
most_popular_items

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
177,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
144,145,Fiery Glass Crusader,9,4.58,41.22
107,108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
81,82,Nirvana,9,4.90,44.10
19,19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Top 5 most profitable items by total purchase value:
  * Item ID
  * Item Name
  * Purchase Count
  * Item Price
  * Total Purchase Value
* Sort the above table by total purchase value in descending order
* Display a preview of the data frame

In [75]:
# sort the items by Total Purchase Value descending and select top 5
most_profitable_items = item_stats.sort_values('Total Purchase Value', ascending=False).head(5)

# print(most_profitable_items)
most_profitable_items

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
177,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
81,82,Nirvana,9,4.90,44.10
144,145,Fiery Glass Crusader,9,4.58,41.22
91,92,Final Critic,8,4.88,39.04
102,103,Singed Scalpel,8,4.35,34.80

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
177,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
81,82,Nirvana,9,4.90,44.10
144,145,Fiery Glass Crusader,9,4.58,41.22
91,92,Final Critic,8,4.88,39.04
102,103,Singed Scalpel,8,4.35,34.80